"use strict";

const CHARAS = {
    "でかなさけ": {
        "初出 (2023/10/17) ": [
            1697554114,
            "👤👈😲あっ！突如として農園に現れたマスコットキャラクターのでかなさけだ！！！",
        ],
    },
    "（名称不明）": { "初出 (2023/10/20) ": [1697780498, "でか😐ぬぇーふ持ってる農民いない？🥺"] },
    "でかなさけトレイン": {
        "初出 (2023/10/22) ": [1697943454, "でかなさけ𝑻𝒓𝒂𝒊𝒏きたよ🟨🟨🟨🟨🟨≡≡💨"],
    },
    "超大型ぷゆゆ": { "初出 (2023/12/3) ": [1701591422, "農園に超大型ぷゆゆ到来"] },
    "ティガレックスなさけ": { "初出 (2023/12/6) ": [1701860073, "┌(┌🥺)┐プユゥ..."] },
    "板イーター": { "初出 (2023/12/11) ": [1702269942, "この板イーターきたよぉ🥺"] },
    "奇行種なさけ": {
        "初出 (2023/12/14) ": [1702488684, "👤新しく生まれ変わった農園をお祝いしに来たよ"],
    },
    "爆撃なさけ（蝙蝠ぷゆゆ）": { "初出 (2023/12/25) ": [1703473544, "四聖獣ってなんなの…？🥺"] },
    "ぽぽ": { "初出 (2024/1/5) ": [1704384742, "ぽぽには優しくしてほしいぽぽ！😭"] },
    "胴長ひろし": { "初出 (2024/1/22) ": [1705919345, "😸安価でこの猫の名前とか色々決めるスレ😸"] },
    "ウォールウィンディ": { "初出 (2024/9/1) ": [1725171305, "🧵新キャラ登場！！！！🧵"] },
};

const charaLink = document.getElementById("charaLink");
const baseURL = "https://tulipplantation.com/#tulipplantation/";

let s = "";
for (const name in CHARAS) {
    s += `<h2>${name}</h2>`;
    s += "<ul>";
    for (const info in CHARAS[name]) {
        const [no, title] = CHARAS[name][info];
        s += `<li>${info}：<a href=${baseURL + no}/ target="_blank" rel="noopener noreferrer">${title}</a></li>`;
    }
    s += "</ul>";
}

charaLink.innerHTML = s;
