"use strict";

const CHARAS = {
    "山田舞花": { "初出 (2023/10/17) ": [1697454765, "承認欲求に飢えてるから安価で女の子作る😡"] },
    "でかなさけ": {
        "初出 (2023/10/17) ": [
            1697554114,
            "👤👈😲あっ！突如として農園に現れたマスコットキャラクターのでかなさけだ！！！",
        ],
    },
    "（名称不明）": { "初出 (2023/10/20) ": [1697780498, "でか😐ぬぇーふ持ってる農民いない？🥺"] },
    "でかなさけトレイン": {
        "初出 (2023/10/22) ": [1697943454, "でかなさけ𝑻𝒓𝒂𝒊𝒏きたよ🟨🟨🟨🟨🟨≡≡💨"],
    },
    "虹なさけ": {
        "初出 (2023/12/2) ": [1701517729, "😲👉あ！見れたら一日ラッキー虹なさけだ！！"],
    },
    "超大型ぷゆゆ": { "初出 (2023/12/3) ": [1701591422, "農園に超大型ぷゆゆ到来"] },
    "ティガレックスなさけ": { "初出 (2023/12/6) ": [1701860073, "┌(┌🥺)┐プユゥ..."] },
    "板イーター": { "初出 (2023/12/11) ": [1702269942, "この板イーターきたよぉ🥺"] },
    "奇行種なさけ": {
        "初出 (2023/12/14) ": [1702488684, "👤新しく生まれ変わった農園をお祝いしに来たよ"],
    },
    "学びガール": {
        "初出 (2023/12/16) ": [
            1702690042,
            "✌👧学びガールの一口豆知識のコーナー✨ [今日の一口豆知識★]",
        ],
    },
    "爆撃なさけ（蝙蝠ぷゆゆ）": { "初出 (2023/12/25) ": [1703473544, "四聖獣ってなんなの…？🥺"] },
    "ぽぽ": { "初出 (2024/1/5) ": [1704384742, "ぽぽには優しくしてほしいぽぽ！😭"] },
    "胴長ひろし": { "初出 (2024/1/22) ": [1705919345, "😸安価でこの猫の名前とか色々決めるスレ😸"] },
    "ビキニなさけ": { "初出 (2024/2/5) ": [1707134678, "ビキニなさけきたよぉ🥺"] },
    "汝英子": {
        "初出 (2024/4/3) ": [
            1712133918,
            "彡(＜👁️＞/🫦＜👁️＞)ミ「どうも、農園の新マスコットキャラクターの汝英子(なん　じぇいこ)です。」【変】",
        ],
    },
    "シードラ": {
        "初出 (2024/4/7) ": [1712492702, "プロのイラストヘーター(下手)だけど安価で絵描く"],
    },
    "ノリオ": {
        "初出 (2024/4/21) ": [1713683463, "クッッッッッッソかわいい農園マスコットキャラ描いた😳"],
    },
    "ウォールウィンディ": { "初出 (2024/9/1) ": [1725171305, "🧵新キャラ登場！！！！🧵"] },
    "あルミ二ウむ🦾くん": {
        "初出 (2024/8/7) ": [1723019145, "農園のマスコットは"],
        "画像初出 (2024/8/7) ": [1723025717, "あルミ二ウむ🦾くんです"],
    },
    //"xxxxxxxxxxxxx": { "初出 (2024//) ": [99999999, "xxxx"] },
    //"xxxxxxxxxxxxx": { "初出 (2024//) ": [99999999, "xxxx"] },
    //"xxxxxxxxxxxxx": { "初出 (2024//) ": [99999999, "xxxx"] },
    //"xxxxxxxxxxxxx": { "初出 (2024//) ": [99999999, "xxxx"] },
};

const charaLink = document.getElementById("charaLink");
const charaIndex = document.getElementById("charaIndex");
const baseURL = "https://tulipplantation.com/#tulipplantation/";

let slist = "<ul>";
let sinfo = "";
for (const name in CHARAS) {
    const id = btoa(encodeURIComponent(name));
    slist += `<li><a href="#${id}">${name}</a></li>`;
    sinfo += `<h2 id="${id}">${name}</h2>`;
    sinfo += "<ul>";
    for (const info in CHARAS[name]) {
        const [no, title] = CHARAS[name][info];
        sinfo += `<li>${info}：<a href=${baseURL + no}/ target="_blank" rel="noopener noreferrer">${title}</a></li>`;
    }
    sinfo += "</ul>";
}
slist += "</ul>";

charaIndex.innerHTML = slist;
charaLink.innerHTML = sinfo;
